import statistics as stat # Импортируем библитотеку чтоб было проще считать
with open('text2.txt', 'w', encoding='utf-8') as f: # открываем и создаем файл
    text = '''
Понедельник
	Физика (лекц.)
	Физика (лаб.)
	Алгебра (практ.)
Вторник
	Геометрия (лекц.)
	Физика (практ.)
	Физика (лаб.)
	Физкультура (практ.)
Среда
	Геометрия (лекц.)
	Физика (практ.)
	Физика (лаб.)
	Физкультура (практ.)
Четверг
	Геометрия (лекц.)
	Физика (практ.)
	Физика (лаб.)
	Физкультура (практ.)
Пятниуа
	Геометрия (лекц.)
	Физика (практ.)
	Физика (лаб.)
	Физкультура (практ.)
Суббота
	Геометрия (лекц.)
	Физика (практ.)
	Физика (лаб.)
	Физкультура (практ.)
'''
    f.write(text) # Записываем
print('_________________________')
print('Расписание занятий:')
print('_________________________')
with open('text2.txt', 'r', encoding='utf-8') as reading: # проверямем что записалось
    reading = reading.read()
    print(reading)
print('_________________________')
print('Количество разных типов занятий:')
print('_________________________')
with open('text2.txt', 'r', encoding='utf-8') as text:
    lessons = text.readlines()
lections = len([i for i in lessons if 'лекц.' in i])
practice = len([i for i in lessons if 'практ.' in i])
laboratory = len([i for i in lessons if 'лаб.' in i])

print(f'Лекций:{lections}')
print(f'Практических:{practice}')
print(f'Лабораторных:{laboratory}')
print('_________________________')